session1/cours/java_io.org
# -*- mode: org; org-confirm-babel-evaluate: nil; org-babel-noweb-wrap-start: "«"; org-babel-noweb-wrap-end: "»"; ispell-local-dictionary: "fr_FR" -*-

#+TITLE: Entrées / Sorties en Java
#+AUTHOR: Bernard Hugueney

#+LANGUAGE: fr
#+LANG: fr

#+BEGIN_SRC elisp :exports none :results silent
 (setq org-ditaa-jar-path "/usr/share/ditaa/ditaa.jar")
(org-babel-do-load-languages
 'org-babel-load-languages
 '((ditaa . t)
   (java . t)))
#+END_SRC


* Utilisation de la console

Lorsqu'on exécute un programme en mode console, par exemple dans un
terminal, mais les IDE ont aussi une fenêtre "Console", on peut écrire
du texte à l'écran et lire du texte à saisi au clavier.

** Écriture dans la console

On a déjà vu comment écrire des données sur l'écran d'une console :
avec les /méthodes/ [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-][print]] et [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#println-java.lang.String-][println]] appelées sur les /objets/
[[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out][System.out]] ou [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err][System.err]].

On parle de /méthodes/ car contrairement aux fonctions qu'on a
écrites, celles-ci sont appelées sur un /objet/ : src_java[:exports
code]{nomDeLObjet.nomDeLaMethode(premierArg, secondArg)}. Les méthodes
qu'on peut appeler sur un /objet/ sont définis par la /classe/ dont il
est une /instance/ (ce qui veut dire que la classe est le type de
l'objet). On a déjà vu par exemple des instances de la classe [[https://docs.oracle.com/javase/9/docs/api/java/lang/String.html][String]].

[[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out][System.out]] écrit sur la [[https://fr.wikipedia.org/wiki/Flux_standard#Sortie_standard][sortie standard]] qui sert aux messages lors
du fonctionnement normal du programme et [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err][System.err]] écrit sur la
[[https://fr.wikipedia.org/wiki/Flux_standard#Erreur_standard][sortie d'erreurs]] qui sert aux messages d'erreur. Par défaut, les
deux sont affichés à l'écran mais on peut les rediriger indépendamment
vers des fichiers. Sous IntelliJ, les deux sont affichés sur la
console, mais les messages sur la sortie d'erreur affichés en rouge.

En consultant la documentation de la classe dans laquelle [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-][print]] et
[[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#println-java.lang.String-][println]] sont définies, on constate que ces méthodes sont /surchargées/
et qu'il y a des implémentations pour tous les types primitifs.

Par ailleurs, il est possible de passer des tableaux en arguments.

- Exercice :: Constater et comprendre le résultat d'un appel de [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-][print]]
              en passant en argument des tableaux de différents types.


