session1/cours/java_io.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2019-10-09 Wed 10:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Entrées / Sorties en Java</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Bernard Hugueney" />
</head>
<body>
<div id="content">
<h1 class="title">Entrées / Sorties en Java</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6a710b7">1. Utilisation de la console</a>
<ul>
<li><a href="#org3a8ec9d">1.1. Écriture dans la console</a></li>
<li><a href="#org9a960b9">1.2. Lecture dans la console</a></li>
</ul>
</li>
<li><a href="#orgd7c9d86">2. Exceptions</a></li>
<li><a href="#org8eef017">3. Utilisation de fichiers</a>
<ul>
<li><a href="#org154b236">3.1. Exceptions vérifiées</a></li>
<li><a href="#org7ab310b">3.2. Chemin absolu ou relatif, répertoire courant</a></li>
<li><a href="#org146a9b4">3.3. Écriture dans un fichier</a></li>
<li><a href="#org2df91c1">3.4. Lecture depuis un fichier</a></li>
</ul>
</li>
<li><a href="#org67d2f8e">4. Gestion des Exceptions</a>
<ul>
<li><a href="#org9b8bd70">4.1. try / catch / finally</a></li>
<li><a href="#orgbd3fb97">4.2. try avec ressources</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6a710b7" class="outline-2">
<h2 id="org6a710b7"><span class="section-number-2">1</span> Utilisation de la console</h2>
<div class="outline-text-2" id="text-1">
<p>
Lorsqu'on exécute un programme en mode console, par exemple dans un
terminal, mais les IDE ont aussi une fenêtre "Console", on peut écrire
du texte à l'écran et lire du texte à saisi au clavier.
</p>
</div>

<div id="outline-container-org3a8ec9d" class="outline-3">
<h3 id="org3a8ec9d"><span class="section-number-3">1.1</span> Écriture dans la console</h3>
<div class="outline-text-3" id="text-1-1">
<p>
On a déjà vu comment écrire des données sur l'écran d'une console :
avec les <i>méthodes</i> <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-">print</a> et <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#println-java.lang.String-">println</a> appelées sur les <i>objets</i>
<a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out">System.out</a> ou <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err">System.err</a>.
</p>

<p>
On parle de <i>méthodes</i> car contrairement aux fonctions qu'on a
écrites, celles-ci sont appelées sur un <i>objet</i> : <code class="src src-java">nomDeLObjet.nomDeLaMethode(<span style="color: #6434A3;">premierArg</span>, <span style="color: #6434A3;">secondArg</span>)</code>. Les méthodes
qu'on peut appeler sur un <i>objet</i> sont définis par la <i>classe</i> dont il
est une <i>instance</i> (ce qui veut dire que la classe est le type de
l'objet). On a déjà vu par exemple des instances de la classe <a href="https://docs.oracle.com/javase/9/docs/api/java/lang/String.html">String</a>.
</p>

<p>
<a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out">System.out</a> écrit sur la <a href="https://fr.wikipedia.org/wiki/Flux_standard#Sortie_standard">sortie standard</a> qui sert aux messages lors
du fonctionnement normal du programme et <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err">System.err</a> écrit sur la
<a href="https://fr.wikipedia.org/wiki/Flux_standard#Erreur_standard">sortie d'erreurs</a> qui sert aux messages d'erreur. Par défaut, les
deux sont affichés à l'écran mais on peut les rediriger indépendamment
vers des fichiers. Sous IntelliJ, les deux sont affichés sur la
console, mais les messages sur la sortie d'erreur affichés en rouge.
</p>

<p>
En consultant la documentation de la classe dans laquelle <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-">print</a> et
<a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#println-java.lang.String-">println</a> sont définies, on constate que ces méthodes sont <i>surchargées</i>
et qu'il y a des implémentations pour tous les types primitifs.
</p>

<p>
Par ailleurs, il est possible de passer des tableaux en arguments.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Constater et comprendre le résultat d'un appel de <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-">print</a>
en passant en argument des tableaux de différents types.</dd>
</dl>
</div>
</div>
