session1/cours/java_io.md
- [Utilisation de la console](#orgf8095a2)
  - [Écriture dans la console](#orga0625e1)
  - [Lecture dans la console](#org13afbfa)
- [Exceptions](#org45249f3)
- [Utilisation de fichiers](#orgd53004f)
  - [Exceptions vérifiées](#org8065b91)
  - [Chemin absolu ou relatif, répertoire courant](#org543a4dd)
  - [Écriture dans un fichier](#orgc642419)
  - [Lecture depuis un fichier](#org882c51a)
- [<a id="orge248a59"></a>Gestion des Exceptions](#org7c16ce1)
  - [try / catch / finally](#org11adba5)
  - [try avec ressources](#org4d6eb30)



<a id="orgf8095a2"></a>

# Utilisation de la console

Lorsqu'on exécute un programme en mode console, par exemple dans un terminal, mais les IDE ont aussi une fenêtre "Console", on peut écrire du texte à l'écran et lire du texte à saisi au clavier.


<a id="orga0625e1"></a>

## Écriture dans la console

On a déjà vu comment écrire des données sur l'écran d'une console : avec les *méthodes* [print](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-) et [println](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#println-java.lang.String-) appelées sur les *objets* [System.out](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out) ou [System.err](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err).

On parle de *méthodes* car contrairement aux fonctions qu'on a écrites, celles-ci sont appelées sur un *objet* : `nomDeLObjet.nomDeLaMethode(premierArg, secondArg)`. Les méthodes qu'on peut appeler sur un *objet* sont définis par la *classe* dont il est une *instance* (ce qui veut dire que la classe est le type de l'objet). On a déjà vu par exemple des instances de la classe [String](https://docs.oracle.com/javase/9/docs/api/java/lang/String.html).

[System.out](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out) écrit sur la [sortie standard](https://fr.wikipedia.org/wiki/Flux_standard#Sortie_standard) qui sert aux messages lors du fonctionnement normal du programme et [System.err](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err) écrit sur la [sortie d'erreurs](https://fr.wikipedia.org/wiki/Flux_standard#Erreur_standard) qui sert aux messages d'erreur. Par défaut, les deux sont affichés à l'écran mais on peut les rediriger indépendamment vers des fichiers. Sous IntelliJ, les deux sont affichés sur la console, mais les messages sur la sortie d'erreur affichés en rouge.

En consultant la documentation de la classe dans laquelle [print](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-) et [println](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#println-java.lang.String-) sont définies, on constate que ces méthodes sont *surchargées* et qu'il y a des implémentations pour tous les types primitifs.

Par ailleurs, il est possible de passer des tableaux en arguments.

-   **Exercice:** Constater et comprendre le résultat d'un appel de [print](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#print-java.lang.String-) en passant en argument des tableaux de différents types.
