session1/cours/java_io.org
** Lecture dans la console

Par défaut, les lecture dans la console correspondent aux saisies au
clavier, qui sont envoyées lors de l'appui sur la touche ⏎ (ou
↵). [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#in][System.in]] correspond à l'[[https://fr.wikipedia.org/wiki/Flux_standard#Entr%25C3%25A9e_standard][entrée standard]] de la console qui peut
être utilisée comme source brute de données sous forme d'octets.


En pratique, on ne voudra généralement pas lire directement des octets
en tant que tel, mais lire des donnés des types de Java
(e.g. src_java[:exports code]{int},src_java[:exports
code]{long},src_java[:exports code]{float},src_java[:exports
code]{double},src_java[:exports code]{String}). Pour cela, la
bibliothèque standard met à disposition la classe [[https://docs.oracle.com/javase/8/docs/api/java/util/Scanner.html][java.util.Scanner]]
utilisée comme suit :
#+BEGIN_SRC java -n   :exports code :tangle ScannerDemo.java 
/*
 La directive import suivante permet ensuite d'écrire Scanner sans
 avoir à écrire java.util.Scanner
,*/
import java.util.Scanner;

public class ScannerDemo {
    public static void main(String[] args){
	Scanner sc = new Scanner(System.in); // lecture depuis l'entrée standard (clavier)
	System.out.println("Saisissez un entier:");
	int i = sc.nextInt();
	System.out.println("Vous avez saisi: "+ i);
	System.out.println("Saisissez un double (penser à la localisation!):");
	double d = sc.nextDouble(); // /!\ Si l'ordinateur est configuré en fr_FR, le séparateur décimal attendu est une virgule !
	System.out.println("Vous avez saisi: "+ d);
	System.out.println("Saisissez une ligne de caractères");
	sc.nextLine(); // /!\ le dernier appel à nextDouble() n'avait pas consommé la fin de ligne !
	String line = sc.nextLine();
	System.out.println("Vous avez saisi: "+ line);
    }
}
#+END_SRC

Il faut donc :
1. importer la classe src_java[:exports code]{java.util.Scanner}
2. instancier un objet de cette classe en passant en argument du
   constructeur l'objet qui représente l'entrée standard de la
   console : src_java[:exports code]{Scanner sc = new
   Scanner(System.in)} (Bien évidemment, on donne le nom qu'on veut à
   la variable utilisée pour stocker la référence de l'objet créé.
3. utiliser ensuite la méthode correspondant au type de donnée à lire



- Exercices ::  
  - Compréhension de code :: Pourquoi la localisation est-elle
       importante pour lire les types de nombres avec une partie
       décimale ?
  - Codage exploratoire :: Que se passe-t-il si l'on enlève la ligne
       src_java[:exports code]{sc.nextLine();} ? Pourquoi ?
  - Tests :: Que se passe-t-il si l'on se rentre pas un nombre
             lorsqu'un nombre est attendu ?

