session1/cours/java_io.html


<div id="outline-container-org9a960b9" class="outline-3">
<h3 id="org9a960b9"><span class="section-number-3">1.2</span> Lecture dans la console</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Par défaut, les lecture dans la console correspondent aux saisies au
clavier, qui sont envoyées lors de l'appui sur la touche ⏎ (ou
↵). <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#in">System.in</a> correspond à l'<a href="https://fr.wikipedia.org/wiki/Flux_standard#Entr%C3%A9e_standard">entrée standard</a> de la console qui peut
être utilisée comme source brute de données sous forme d'octets.
</p>


<p>
En pratique, on ne voudra généralement pas lire directement des octets
en tant que tel, mais lire des donnés des types de Java
(e.g. <code class="src src-java"><span style="color: #6434A3;">int</span></code>,<code class="src src-java"><span style="color: #6434A3;">long</span></code>,<code class="src src-java"><span style="color: #6434A3;">float</span></code>,<code class="src src-java"><span style="color: #6434A3;">double</span></code>,<code class="src src-java">String</code>). Pour cela, la
bibliothèque standard met à disposition la classe <a href="https://docs.oracle.com/javase/8/docs/api/java/util/Scanner.html">java.util.Scanner</a>
utilisée comme suit :
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="linenr"> 1: </span><span style="color: #8D8D84;">/*</span>
<span class="linenr"> 2: </span><span style="color: #8D8D84; font-style: italic;"> La directive import suivante permet ensuite d'&#233;crire Scanner sans</span>
<span class="linenr"> 3: </span><span style="color: #8D8D84; font-style: italic;"> avoir &#224; &#233;crire java.util.Scanner</span>
<span class="linenr"> 4: </span><span style="color: #8D8D84; font-style: italic;">*/</span>
<span class="linenr"> 5: </span><span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Scanner</span>;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ScannerDemo</span> {
<span class="linenr"> 8: </span>    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>){
<span class="linenr"> 9: </span>        <span style="color: #6434A3;">Scanner</span> <span style="color: #BA36A5;">sc</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Scanner</span>(System.in); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">lecture depuis l'entr&#233;e standard (clavier)</span>
<span class="linenr">10: </span>        System.out.println(<span style="color: #008000;">"Saisissez un entier:"</span>);
<span class="linenr">11: </span>        <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span> = sc.nextInt();
<span class="linenr">12: </span>        System.out.println(<span style="color: #008000;">"Vous avez saisi: "</span>+ i);
<span class="linenr">13: </span>        System.out.println(<span style="color: #008000;">"Saisissez un double (penser &#224; la localisation!):"</span>);
<span class="linenr">14: </span>        <span style="color: #6434A3;">double</span> <span style="color: #BA36A5;">d</span> = sc.nextDouble(); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">/!\ Si l'ordinateur est configur&#233; en fr_FR, le s&#233;parateur d&#233;cimal attendu est une virgule !</span>
<span class="linenr">15: </span>        System.out.println(<span style="color: #008000;">"Vous avez saisi: "</span>+ d);
<span class="linenr">16: </span>        System.out.println(<span style="color: #008000;">"Saisissez une ligne de caract&#232;res"</span>);
<span class="linenr">17: </span>        sc.nextLine(); <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">/!\ le dernier appel &#224; nextDouble() n'avait pas consomm&#233; la fin de ligne !</span>
<span class="linenr">18: </span>        <span style="color: #6434A3;">String</span> <span style="color: #BA36A5;">line</span> = sc.nextLine();
<span class="linenr">19: </span>        System.out.println(<span style="color: #008000;">"Vous avez saisi: "</span>+ line);
<span class="linenr">20: </span>    }
<span class="linenr">21: </span>}
</pre>
</div>

<p>
Il faut donc :
</p>
<ol class="org-ol">
<li>importer la classe scr_java[:exports code]{java.util.Scanner}</li>
<li>instancier un objet de cette classe en passant en argument du
constructeur l'objet qui représente l'entrée standard de la
console : <code class="src src-java"><span style="color: #6434A3;">Scanner</span> <span style="color: #BA36A5;">sc</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Scanner</span>(System.in)</code> (Bien évidemment, on donne le nom qu'on veut à
la variable utilisée pour stocker la référence de l'objet créé.</li>
<li>utiliser ensuite la méthode correspondant au type de donnée à lire</li>
</ol>



<dl class="org-dl">
<dt>Exercices</dt><dd> 
<dl class="org-dl">
<dt>Compréhension de code</dt><dd>Pourquoi la localisation est-elle
importante pour lire les types de nombres avec une partie
décimale ?</dd>
<dt>Codage exploratoire</dt><dd>Que se passe-t-il si l'on enlève la ligne
<code class="src src-java">sc.nextLine();</code> ? Pourquoi ?</dd>
<dt>Tests</dt><dd>Que se passe-t-il si l'on se rentre pas un nombre
lorsqu'un nombre est attendu ?</dd>
</dl></dd>
</dl>
</div>
</div>
</div>
