session1/cours/java_io.md


<a id="org13afbfa"></a>

## Lecture dans la console

Par défaut, les lecture dans la console correspondent aux saisies au clavier, qui sont envoyées lors de l'appui sur la touche ⏎ (ou ↵). [System.in](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#in) correspond à l'[entrée standard](https://fr.wikipedia.org/wiki/Flux_standard#Entr%C3%A9e_standard) de la console qui peut être utilisée comme source brute de données sous forme d'octets.

En pratique, on ne voudra généralement pas lire directement des octets en tant que tel, mais lire des donnés des types de Java (e.g. `int`,`long`,`float`,`double`,`String`). Pour cela, la bibliothèque standard met à disposition la classe [java.util.Scanner](https://docs.oracle.com/javase/8/docs/api/java/util/Scanner.html) utilisée comme suit :

```java
 1  /*
 2   La directive import suivante permet ensuite d'écrire Scanner sans
 3   avoir à écrire java.util.Scanner
 4  */
 5  import java.util.Scanner;
 6  
 7  public class ScannerDemo {
 8      public static void main(String[] args){
 9  	Scanner sc = new Scanner(System.in); // lecture depuis l'entrée standard (clavier)
10  	System.out.println("Saisissez un entier:");
11  	int i = sc.nextInt();
12  	System.out.println("Vous avez saisi: "+ i);
13  	System.out.println("Saisissez un double (penser à la localisation!):");
14  	double d = sc.nextDouble(); // /!\ Si l'ordinateur est configuré en fr_FR, le séparateur décimal attendu est une virgule !
15  	System.out.println("Vous avez saisi: "+ d);
16  	System.out.println("Saisissez une ligne de caractères");
17  	sc.nextLine(); // /!\ le dernier appel à nextDouble() n'avait pas consommé la fin de ligne !
18  	String line = sc.nextLine();
19  	System.out.println("Vous avez saisi: "+ line);
20      }
21  }
```

Il faut donc :

1.  importer la classe `java.util.Scanner`
2.  instancier un objet de cette classe en passant en argument du constructeur l'objet qui représente l'entrée standard de la console : `Scanner sc = new Scanner(System.in)` (Bien évidemment, on donne le nom qu'on veut à la variable utilisée pour stocker la référence de l'objet créé.
3.  utiliser ensuite la méthode correspondant au type de donnée à lire

-   **Exercices:**  
    -   **Compréhension de code:** Pourquoi la localisation est-elle importante pour lire les types de nombres avec une partie décimale ?
    -   **Codage exploratoire:** Que se passe-t-il si l'on enlève la ligne `sc.nextLine();` ? Pourquoi ?
    -   **Tests:** Que se passe-t-il si l'on se rentre pas un nombre lorsqu'un nombre est attendu ?
