session1/cours/java_io.org
* Exceptions

Lorsqu'on a effectué une saisie invalide, par exemple avec un chaîne
de caractères ne représentant pas un nombre, avec le programme
précédant, on obtient un message d'erreur dans la console :
#+BEGIN_VERSE
Exception in thread "main" java.util.InputMismatchException
	at java.util.Scanner.throwFor(Scanner.java:864)
	at java.util.Scanner.next(Scanner.java:1485)
	at java.util.Scanner.nextInt(Scanner.java:2117)
	at java.util.Scanner.nextInt(Scanner.java:2076)
	at ScannerDemo.main(ScannerDemo.java:11)

#+END_VERSE

Il s'agit d'une [[https://docs.oracle.com/javase/tutorial/essential/exceptions/index.html][Exception]] qui indique une erreur à l'exécution,
erreur dont la nature est indiquée par le type de l'exception, ici
src_java[:exports code]{java.util.InputMismatchException}, les lignes
suivantes permettant de retracer l'origine de l'erreur (ici l'appel à
la méthode src_java[:exports code]{nextInt()} sur un objet de classe
src_java[:exports code]{java.util.Scanner} dans la fonction
src_java[:exports code]{main} de la classe src_java[:exports
code]{ScannerDemo} à la ligne ~11~ du fichier ~ScannerDemo.java~.

- Exercices ::  
  - Compréhension :: Comprendre comment retrouver toutes les
                     informations précédentes dans le message d'erreur
                     (appelé /stack trace/).
  - Codage exploratoire :: Écrire des programmes pour déclencher les
       types d'erreurs suivantes (et comprendre les /stack traces/) :
    - tentative de diviser par 0.
    - tentative d'appeler une méthode sur une référence d'objet (de
      classe src_java[:exports code]{String} ou src_java[:exports
      code]{java.util.Scanner}) non initialisée.
    - tentative d'accès à une case d'un tableau ou à la longueur d'un
      tableau par une référence non initialisé.
    - tentative d'accès à une case d'un tableau correctement
      initialisé, mais avec un indice invalide (trop grand ou négatif).
    - appel d'une fonction récursive sans condition d'arrêt.
 
* Utilisation de fichiers

** Exceptions vérifiées

On vient de voir que certaines circonstances très fréquentes (un appel
de fonction, une utilisation d'un objet ou l'accès à une case d'un
tableau) pouvaient [[https://fr.wikipedia.org/wiki/Syst%25C3%25A8me_de_gestion_d%2527exceptions#Java][déclencher des exceptions]] (on dit /lancer/ des
exceptions car celles-ci remontent la pile d'appels de fonction, comme
on peut le constater sur la /stack trace/). Bien sûr, on ne peut pas
être paranoïaque au point de s'inquiéter à chaque fois qu'on utilise
une référence, mais il y a des circonstances qui doivent a priori
inciter à la prudence et à envisager des cas d'erreur. Par exemple à
chaque fois qu'on utilise un fichier, il y a un risque d'erreur de
lecture ou d'écriture (que le fichier ne soit pas accessible parce
qu'il n'existe pas ou qu'on a pas les droits d'accès, où que le
périphérique soit défaillant). Pour ces cas de figure, java dispose
d'exceptions /contrôlées/ ([[https://en.wikibooks.org/wiki/Java_Programming/Checked_Exceptions][Checked Exceptions]]) qui doivent être
explicitement prises en compte. Lorsqu'on fait un appel à une méthode
qui peut lancer une /checked exception/ on doit obligatoirement faire
l'une ou l'autre des choses suivantes :

- [[https://docs.oracle.com/javase/tutorial/essential/exceptions/declaring.html][déclarer que la méthode qu'on est en train d'implémenter peut
  elle-même lancer (en fait, propager) une telle exception]] en
  utilisant le mot-clé src_java[:exports code]{throws}
- [[https://docs.oracle.com/javase/tutorial/essential/exceptions/handling.html][gérer localement l'exception]] en utilisant des blocs
  src_java[:exports code]{try} / src_java[:exports code]{catch} et
  éventuellement src_java[:exports code]{finally}.


Seulement pour l'exposé des classes et méthodes mises en œuvre pour la
lecture ou l'écriture dans un fichier, on se contentera d'ajouter src_java[:exports code]{throws Exception} à la déclaration de la fonction du programme principal :
#+BEGIN_SRC java :exports code
public static void main(String[] args) throws Exception{
/* program that can throw (checked) exceptions for instance by calling
  methodes that throw checked exceptions */
}
#+END_SRC

