session1/cours/java_io.html

<div id="outline-container-orgd7c9d86" class="outline-2">
<h2 id="orgd7c9d86"><span class="section-number-2">2</span> Exceptions</h2>
<div class="outline-text-2" id="text-2">
<p>
Lorsqu'on a effectué une saisie invalide, par exemple avec un chaîne
de caractères ne représentant pas un nombre, avec le programme
précédant, on obtient un message d'erreur dans la console :
</p>
<p class="verse">
Exception in thread "main" java.util.InputMismatchException<br />
&#xa0;at java.util.Scanner.throwFor(Scanner.java:864)<br />
&#xa0;at java.util.Scanner.next(Scanner.java:1485)<br />
&#xa0;at java.util.Scanner.nextInt(Scanner.java:2117)<br />
&#xa0;at java.util.Scanner.nextInt(Scanner.java:2076)<br />
&#xa0;at ScannerDemo.main(ScannerDemo.java:11)<br />
<br />
</p>

<p>
Il s'agit d'une <a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/index.html">Exception</a> qui indique une erreur à l'exécution,
erreur dont la nature est indiquée par le type de l'exception, ici
<code class="src src-java"><span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.InputMismatchException</code>, les lignes
suivantes permettant de retracer l'origine de l'erreur (ici l'appel à
la méthode <code class="src src-java">nextInt()</code> sur un objet de classe
<code class="src src-java"><span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.Scanner</code> dans la fonction
<code class="src src-java">main</code> de la classe <code class="src src-java">ScannerDemo</code> à la ligne <code>11</code> du fichier <code>ScannerDemo.java</code>.
</p>

<dl class="org-dl">
<dt>Exercices</dt><dd> 
<dl class="org-dl">
<dt>Compréhension</dt><dd>Comprendre comment retrouver toutes les
informations précédentes dans le message d'erreur
(appelé <i>stack trace</i>).</dd>
<dt>Codage exploratoire</dt><dd>Écrire des programmes pour déclencher les
types d'erreurs suivantes (et comprendre les <i>stack traces</i>) :
<ul class="org-ul">
<li>tentative de diviser par 0.</li>
<li>tentative d'appeler une méthode sur une référence d'objet (de
classe <code class="src src-java">String</code> ou <code class="src src-java"><span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.Scanner</code>) non initialisée.</li>
<li>tentative d'accès à une case d'un tableau ou à la longueur d'un
tableau par une référence non initialisé.</li>
<li>tentative d'accès à une case d'un tableau correctement
initialisé, mais avec un indice invalide (trop grand ou négatif).</li>
<li>appel d'une fonction récursive sans condition d'arrêt.</li>
</ul></dd>
</dl></dd>
</dl>
</div>
</div>

<div id="outline-container-org8eef017" class="outline-2">
<h2 id="org8eef017"><span class="section-number-2">3</span> Utilisation de fichiers</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org154b236" class="outline-3">
<h3 id="org154b236"><span class="section-number-3">3.1</span> Exceptions vérifiées</h3>
<div class="outline-text-3" id="text-3-1">
<p>
On vient de voir que certaines circonstances très fréquentes (un appel
de fonction, une utilisation d'un objet ou l'accès à une case d'un
tableau) pouvaient <a href="https://fr.wikipedia.org/wiki/Syst%C3%A8me_de_gestion_d%27exceptions#Java">déclencher des exceptions</a> (on dit <i>lancer</i> des
exceptions car celles-ci remontent la pile d'appels de fonction, comme
on peut le constater sur la <i>stack trace</i>). Bien sûr, on ne peut pas
être paranoïaque au point de s'inquiéter à chaque fois qu'on utilise
une référence, mais il y a des circonstances qui doivent a priori
inciter à la prudence et à envisager des cas d'erreur. Par exemple à
chaque fois qu'on utilise un fichier, il y a un risque d'erreur de
lecture ou d'écriture (que le fichier ne soit pas accessible parce
qu'il n'existe pas ou qu'on a pas les droits d'accès, où que le
périphérique soit défaillant). Pour ces cas de figure, java dispose
d'exceptions <i>contrôlées</i> (<a href="https://en.wikibooks.org/wiki/Java_Programming/Checked_Exceptions">Checked Exceptions</a>) qui doivent être
explicitement prises en compte. Lorsqu'on fait un appel à une méthode
qui peut lancer une <i>checked exception</i> on doit obligatoirement faire
l'une ou l'autre des choses suivantes :
</p>

<ul class="org-ul">
<li><a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/declaring.html">déclarer que la méthode qu'on est en train d'implémenter peut
elle-même lancer (en fait, propager) une telle exception</a> en
utilisant le mot-clé <code class="src src-java"><span style="color: #0000FF;">throws</span></code></li>
<li><a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/handling.html">gérer localement l'exception</a> en utilisant des blocs
<code class="src src-java"><span style="color: #0000FF;">try</span></code> / <code class="src src-java"><span style="color: #0000FF;">catch</span></code> et
éventuellement <code class="src src-java"><span style="color: #0000FF;">finally</span></code>.</li>
</ul>


<p>
Seulement pour l'exposé des classes et méthodes mises en œuvre pour la
lecture ou l'écriture dans un fichier, on se contentera d'ajouter <code class="src src-java"><span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span></code> à la déclaration de la fonction du programme principal :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">Exception</span>{
<span style="color: #8D8D84;">/* </span><span style="color: #8D8D84; font-style: italic;">program that can throw (checked) exceptions for instance by calling</span>
<span style="color: #8D8D84; font-style: italic;">  methodes that throw checked exceptions */</span>
}
</pre>
</div>
</div>
</div>
