session1/cours/java_io.md


<a id="org45249f3"></a>

# Exceptions

Lorsqu'on a effectué une saisie invalide, par exemple avec un chaîne de caractères ne représentant pas un nombre, avec le programme précédant, on obtient un message d'erreur dans la console :

<p class="verse">
Exception in thread "main" java.util.InputMismatchException<br />
&#xa0;at java.util.Scanner.throwFor(Scanner.java:864)<br />
&#xa0;at java.util.Scanner.next(Scanner.java:1485)<br />
&#xa0;at java.util.Scanner.nextInt(Scanner.java:2117)<br />
&#xa0;at java.util.Scanner.nextInt(Scanner.java:2076)<br />
&#xa0;at ScannerDemo.main(ScannerDemo.java:11)<br />
<br />
</p>

Il s'agit d'une [Exception](https://docs.oracle.com/javase/tutorial/essential/exceptions/index.html) qui indique une erreur à l'exécution, erreur dont la nature est indiquée par le type de l'exception, ici `java.util.InputMismatchException`, les lignes suivantes permettant de retracer l'origine de l'erreur (ici l'appel à la méthode `nextInt()` sur un objet de classe `java.util.Scanner` dans la fonction `main` de la classe `ScannerDemo` à la ligne `11` du fichier `ScannerDemo.java`.

-   **Exercices:**  
    -   **Compréhension:** Comprendre comment retrouver toutes les informations précédentes dans le message d'erreur (appelé *stack trace*).
    -   **Codage exploratoire:** Écrire des programmes pour déclencher les types d'erreurs suivantes (et comprendre les *stack traces*) :
        -   tentative de diviser par 0.
        -   tentative d'appeler une méthode sur une référence d'objet (de classe `String` ou `java.util.Scanner`) non initialisée.
        -   tentative d'accès à une case d'un tableau ou à la longueur d'un tableau par une référence non initialisé.
        -   tentative d'accès à une case d'un tableau correctement initialisé, mais avec un indice invalide (trop grand ou négatif).
        -   appel d'une fonction récursive sans condition d'arrêt.


<a id="orgd53004f"></a>

# Utilisation de fichiers


<a id="org8065b91"></a>

## Exceptions vérifiées

On vient de voir que certaines circonstances très fréquentes (un appel de fonction, une utilisation d'un objet ou l'accès à une case d'un tableau) pouvaient [déclencher des exceptions](https://fr.wikipedia.org/wiki/Syst%C3%A8me_de_gestion_d%27exceptions#Java) (on dit *lancer* des exceptions car celles-ci remontent la pile d'appels de fonction, comme on peut le constater sur la *stack trace*). Bien sûr, on ne peut pas être paranoïaque au point de s'inquiéter à chaque fois qu'on utilise une référence, mais il y a des circonstances qui doivent a priori inciter à la prudence et à envisager des cas d'erreur. Par exemple à chaque fois qu'on utilise un fichier, il y a un risque d'erreur de lecture ou d'écriture (que le fichier ne soit pas accessible parce qu'il n'existe pas ou qu'on a pas les droits d'accès, où que le périphérique soit défaillant). Pour ces cas de figure, java dispose d'exceptions *contrôlées* ([Checked Exceptions](https://en.wikibooks.org/wiki/Java_Programming/Checked_Exceptions)) qui doivent être explicitement prises en compte. Lorsqu'on fait un appel à une méthode qui peut lancer une *checked exception* on doit obligatoirement faire l'une ou l'autre des choses suivantes :

-   [déclarer que la méthode qu'on est en train d'implémenter peut elle-même lancer (en fait, propager) une telle exception](https://docs.oracle.com/javase/tutorial/essential/exceptions/declaring.html) en utilisant le mot-clé `throws`
-   [gérer localement l'exception](https://docs.oracle.com/javase/tutorial/essential/exceptions/handling.html) en utilisant des blocs `try` / `catch` et éventuellement `finally`.

Seulement pour l'exposé des classes et méthodes mises en œuvre pour la lecture ou l'écriture dans un fichier, on se contentera d'ajouter `throws Exception` à la déclaration de la fonction du programme principal :

```java
public static void main(String[] args) throws Exception{
/* program that can throw (checked) exceptions for instance by calling
  methodes that throw checked exceptions */
}
```
