session1/cours/java_io.org
** Chemin absolu ou relatif, répertoire courant

Les fichiers et répertoires sont désignés par un chemin qui peut être :
- absolu :: le chemin commence alors par une barre oblique (/slash/)
            ~/~ sous Unix/MacOS qui indique la racine du système de
            fichier ou par l'identifiant d'un "lecteur"(/drive/ ~A:~,
            ~B:~,…) sous Windows.
- relatif :: le chemin commence alors par ~.~ pour indiquer le
             répertoire courant (/working directory/) ou par ~..~ pour
             indiquer le répertoire parent [fn::on peut remonter dans
             l'arborescence de répertoires en cumulant les ~../..~].


En pratique, le code d'un vrai programme ne devrait *jamais* contenir
de chemin absolu vers un fichier de données dans un compte utilisateur
car il ne pourrait alors fonctionner que sur la machine du
développeur.

Lorsqu'on lance un programme depuis la console, le répertoire courant
est celui dans lequel on exécute la commande pour lancer le
programme. Lorsqu'on exécute un programme depuis un IDE, il faut
savoir quel est le répertoire courant au lancement d'un programme. Il
s'agit souvent du répertoire dans lequel est enregistré le projet mais
on peut le modifier dans le configurations de lancement (de la même
façon qu'on peut modifier les arguments passés au programme et
récupérés dans l'argument de la fonction src_java[:exports
code]{public static void main(String[] args)}).

** Écriture dans un fichier

Il y a plusieurs façons d'écrire dans un fichier de texte, notamment
en utilisant une instance spécifique de la classe [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html][java.io.PrintStream]]
à la place de [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out][System.out]] ou [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err][System.err]] (qui sont aussi des instances
de cette classe). Il faut pour cela passer par un objet intermédiaire
de la classe [[https://docs.oracle.com/javase/8/docs/api/java/io/FileOutputStream.html][java.io.FileOutputStream]] :
#+BEGIN_SRC java :exports code :tangle PrintStreamDemo.java
import java.io.FileOutputStream;
import java.io.PrintStream;
import java.io.FileNotFoundException;

public class PrintStreamDemo {
    public static void main(String[] args) throws FileNotFoundException {
	PrintStream fileOut = new PrintStream(new FileOutputStream("textFile.txt"));
	fileOut.print("Hello ");
	fileOut.println("World !");
	fileOut.close();
    }
}
#+END_SRC

Vous pouvez ensuite utiliser l'instance de [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html][java.io.PrintStream]] comme
vous utiliseriez [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out][System.out]] ou [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err][System.err]], avec la seule différence
qu'il faut appeler la méthode [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#close--][close()]] qui fermera le fichier
sous-jacent. En fait, il faudra s'assurer que cette fonction est bien
appelée *dans tous les cas*, ce qui n'est pas évident dans le cas de
lancement d'exceptions. Nous verrons comment faire en section
[[sec:exceptions_handling]].

