session1/cours/java_io.html

<div id="outline-container-org7ab310b" class="outline-3">
<h3 id="org7ab310b"><span class="section-number-3">3.2</span> Chemin absolu ou relatif, répertoire courant</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Les fichiers et répertoires sont désignés par un chemin qui peut être :
</p>
<dl class="org-dl">
<dt>absolu</dt><dd>le chemin commence alors par une barre oblique (<i>slash</i>)
<code>/</code> sous Unix/MacOS qui indique la racine du système de
fichier ou par l'identifiant d'un "lecteur"(<i>drive</i> <code>A:</code>,
<code>B:</code>,…) sous Windows.</dd>
<dt>relatif</dt><dd>le chemin commence alors par <code>.</code> pour indiquer le
répertoire courant (<i>working directory</i>) ou par <code>..</code> pour
indiquer le répertoire parent <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.</dd>
</dl>


<p>
En pratique, le code d'un vrai programme ne devrait <b>jamais</b> contenir
de chemin absolu vers un fichier de données dans un compte utilisateur
car il ne pourrait alors fonctionner que sur la machine du
développeur.
</p>

<p>
Lorsqu'on lance un programme depuis la console, le répertoire courant
est celui dans lequel on exécute la commande pour lancer le
programme. Lorsqu'on exécute un programme depuis un IDE, il faut
savoir quel est le répertoire courant au lancement d'un programme. Il
s'agit souvent du répertoire dans lequel est enregistré le projet mais
on peut le modifier dans le configurations de lancement (de la même
façon qu'on peut modifier les arguments passés au programme et
récupérés dans l'argument de la fonction <code class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>)</code>).
</p>
</div>
</div>

<div id="outline-container-org146a9b4" class="outline-3">
<h3 id="org146a9b4"><span class="section-number-3">3.3</span> Écriture dans un fichier</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Il y a plusieurs façons d'écrire dans un fichier de texte, notamment
en utilisant une instance spécifique de la classe <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html">java.io.PrintStream</a>
à la place de <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out">System.out</a> ou <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err">System.err</a> (qui sont aussi des instances
de cette classe). Il faut pour cela passer par un objet intermédiaire
de la classe <a href="https://docs.oracle.com/javase/8/docs/api/java/io/FileOutputStream.html">java.io.FileOutputStream</a> :
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">FileOutputStream</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">PrintStream</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">FileNotFoundException</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">PrintStreamDemo</span> {
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">FileNotFoundException</span> {
        <span style="color: #6434A3;">PrintStream</span> <span style="color: #BA36A5;">fileOut</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">PrintStream</span>(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">FileOutputStream</span>(<span style="color: #008000;">"textFile.txt"</span>));
        fileOut.print(<span style="color: #008000;">"Hello "</span>);
        fileOut.println(<span style="color: #008000;">"World !"</span>);
        fileOut.close();
    }
}
</pre>
</div>

<p>
Vous pouvez ensuite utiliser l'instance de <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html">java.io.PrintStream</a> comme
vous utiliseriez <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out">System.out</a> ou <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err">System.err</a>, avec la seule différence
qu'il faut appeler la méthode <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#close--">close()</a> qui fermera le fichier
sous-jacent. En fait, il faudra s'assurer que cette fonction est bien
appelée <b>dans tous les cas</b>, ce qui n'est pas évident dans le cas de
lancement d'exceptions. Nous verrons comment faire en section
<a href="#org11cd535">4</a>.
</p>
</div>
</div>
