session1/cours/java_io.md


<a id="org543a4dd"></a>

## Chemin absolu ou relatif, répertoire courant

Les fichiers et répertoires sont désignés par un chemin qui peut être :

-   **absolu:** le chemin commence alors par une barre oblique (*slash*) `/` sous Unix/MacOS qui indique la racine du système de fichier ou par l'identifiant d'un "lecteur"(*drive* `A:`, `B:`,…) sous Windows.
-   **relatif:** le chemin commence alors par `.` pour indiquer le répertoire courant (*working directory*) ou par `..` pour indiquer le répertoire parent <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>.

En pratique, le code d'un vrai programme ne devrait **jamais** contenir de chemin absolu vers un fichier de données dans un compte utilisateur car il ne pourrait alors fonctionner que sur la machine du développeur.

Lorsqu'on lance un programme depuis la console, le répertoire courant est celui dans lequel on exécute la commande pour lancer le programme. Lorsqu'on exécute un programme depuis un IDE, il faut savoir quel est le répertoire courant au lancement d'un programme. Il s'agit souvent du répertoire dans lequel est enregistré le projet mais on peut le modifier dans le configurations de lancement (de la même façon qu'on peut modifier les arguments passés au programme et récupérés dans l'argument de la fonction `public static void main(String[] args)`).


<a id="orgc642419"></a>

## Écriture dans un fichier

Il y a plusieurs façons d'écrire dans un fichier de texte, notamment en utilisant une instance spécifique de la classe [java.io.PrintStream](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html) à la place de [System.out](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out) ou [System.err](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err) (qui sont aussi des instances de cette classe). Il faut pour cela passer par un objet intermédiaire de la classe [java.io.FileOutputStream](https://docs.oracle.com/javase/8/docs/api/java/io/FileOutputStream.html) :

```java
import java.io.FileOutputStream;
import java.io.PrintStream;
import java.io.FileNotFoundException;

public class PrintStreamDemo {
    public static void main(String[] args) throws FileNotFoundException {
	PrintStream fileOut = new PrintStream(new FileOutputStream("textFile.txt"));
	fileOut.print("Hello ");
	fileOut.println("World !");
	fileOut.close();
    }
}
```

Vous pouvez ensuite utiliser l'instance de [java.io.PrintStream](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html) comme vous utiliseriez [System.out](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#out) ou [System.err](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#err), avec la seule différence qu'il faut appeler la méthode [close()](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html#close--) qui fermera le fichier sous-jacent. En fait, il faudra s'assurer que cette fonction est bien appelée **dans tous les cas**, ce qui n'est pas évident dans le cas de lancement d'exceptions. Nous verrons comment faire en section [4](#orge248a59).
