session1/cours/java_io.org
** Lecture depuis un fichier

 Il y a plusieurs façons de lire le contenu d'un petit fichier de
 texte, mais on peut notamment utiliser une instance de la classe
 [[https://docs.oracle.com/javase/8/docs/api/java/io/File.html][java.io.File]] à la place de [[https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#in][System.in]] :

#+BEGIN_SRC java :exports code :tangle ScannerFromFileDemo.java
import java.io.FileNotFoundException;
import java.io.File;
import java.util.Scanner;

public class ScannerFromFileDemo {
    public static void main(String[] args) throws FileNotFoundException {
	Scanner sc = new Scanner(new File("inputFile.txt"));
	for(int i=0; sc.hasNextLine(); ++i){
	    System.out.println("["+i+"]:"+ sc.nextLine());
	}
	sc.close();
    }
}

#+END_SRC

De même que pour l'instance de l'instance de [[https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html][java.io.PrintStream]], il faut désormais s'assurer que la méthode [[https://docs.oracle.com/javase/10/docs/api/java/util/Scanner.html#close()][close()]] est appelée.

- Exercice :: Modifier le programme ci-dessus pour qu'il lise les
              mêmes informations que le programme ~ScannerDemo~ et
              mettre le code de lecture dans une autre fonction
              appelée par java_src[:exports code]{main}.

* <<sec:exceptions_handling>>Gestion des Exceptions

En pratique, on ne peut évidemment pas se contenter de laisser les
exceptions se propager. On va donc les [[https://docs.oracle.com/javase/tutorial/essential/exceptions/handling.html][gérer localement]] en utilisant
des blocs src_java[:exports code]{try} / src_java[:exports
code]{catch} et éventuellement src_java[:exports code]{finally}.

** try / catch / finally

On doit commencer par déclarer le début d'un bloc src_java[:exports
code]{try} avant de faire l'opération qui peut lancer une exception
contrôlée. Le bloc src_java[:exports code]{try} doit non seulement
contenir cette opération, mais toutes celles-ci en dépendent, par
exemple tout le code qui utilise un objet dont la construction aurait
pu déclencher une exception.

À la suite de ce bloc, on indique quelle exception on veut intercepter
avec un bloc src_java[:exports code]{catch}. bloc src_java[:exports
code]{catch} prend un argument dont le type est celui de l'exception à
intercepter, ce qui permet d'utiliser cet argument ensuite dans le
bloc.

On doit utiliser un bloc src_java[:exports code]{finally} lorsqu'il y a du code qui doit être exécuté dans tous les cas :
- pas d'exception ou exception interceptée
- exception propagée

- Exercice ::  

  - Modification de code :: Modifier les programmes précédents pour
       que src_java[:exports code]{main} ne laisse plus échapper
       d'exception mais affiche un message d'erreur. N'oubliez pas que
       l'appel à src_java[:exports code]{.close()} doit être effectué
       *dans tous les cas*.

  - Ajout de fonctionalité :: Modifier les programmes précédents pour
       qu'en cas d'erreur, ils proposent de recommencer :
    - en effectuant une autre saisie pour la lecture d'un nombre

    - en saisissant un nom de fichier pour la lecture à partir d'un
      fichier (dans le cas d'une src_java[:exports
      code]{FileNotFoundException}).
 
Pour aller plus loin, [[https://www.jmdoudoux.fr/java/dej/chap-exceptions.htm][une ressource indiquant notamment comment créer
ses propres types d'exceptions]].

