session1/cours/java_io.html

<div id="outline-container-org2df91c1" class="outline-3">
<h3 id="org2df91c1"><span class="section-number-3">3.4</span> Lecture depuis un fichier</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Il y a plusieurs façons de lire le contenu d'un petit fichier de
texte, mais on peut notamment utiliser une instance de la classe
<a href="https://docs.oracle.com/javase/8/docs/api/java/io/File.html">java.io.File</a> à la place de <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#in">System.in</a> :
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">FileNotFoundException</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">io</span>.<span style="color: #6434A3;">File</span>;
<span style="color: #0000FF;">import</span> <span style="color: #D0372D;">java</span>.<span style="color: #D0372D;">util</span>.<span style="color: #6434A3;">Scanner</span>;

<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">ScannerFromFileDemo</span> {
    <span style="color: #0000FF;">public</span> <span style="color: #0000FF;">static</span> <span style="color: #6434A3;">void</span> <span style="color: #006699;">main</span>(<span style="color: #6434A3;">String</span>[] <span style="color: #BA36A5;">args</span>) <span style="color: #0000FF;">throws</span> <span style="color: #6434A3;">FileNotFoundException</span> {
        <span style="color: #6434A3;">Scanner</span> <span style="color: #BA36A5;">sc</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">Scanner</span>(<span style="color: #0000FF;">new</span> <span style="color: #6434A3;">File</span>(<span style="color: #008000;">"inputFile.txt"</span>));
        <span style="color: #0000FF;">for</span>(<span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">i</span>=0; sc.hasNextLine(); ++i){
            System.out.println(<span style="color: #008000;">"["</span>+i+<span style="color: #008000;">"]:"</span>+ sc.nextLine());
        }
        sc.close();
    }
}

</pre>
</div>

<p>
De même que pour l'instance de l'instance de <a href="https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html">java.io.PrintStream</a>, il faut désormais s'assurer que la méthode <a href="https://docs.oracle.com/javase/10/docs/api/java/util/Scanner.html#close()">close()</a> est appelée.
</p>

<dl class="org-dl">
<dt>Exercice</dt><dd>Modifier le programme ci-dessus pour qu'il lise les
mêmes informations que le programme <code>ScannerDemo</code> et
mettre le code de lecture dans une autre fonction
appelée par java_src[:exports code]{main}.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org67d2f8e" class="outline-2">
<h2 id="org67d2f8e"><span class="section-number-2">4</span> <a id="org11cd535"></a>Gestion des Exceptions</h2>
<div class="outline-text-2" id="text-4">
<p>
En pratique, on ne peut évidemment pas se contenter de laisser les
exceptions se propager. On va donc les <a href="https://docs.oracle.com/javase/tutorial/essential/exceptions/handling.html">gérer localement</a> en utilisant
des blocs <code class="src src-java"><span style="color: #0000FF;">try</span></code> / <code class="src src-java"><span style="color: #0000FF;">catch</span></code> et éventuellement <code class="src src-java"><span style="color: #0000FF;">finally</span></code>.
</p>
</div>

<div id="outline-container-org9b8bd70" class="outline-3">
<h3 id="org9b8bd70"><span class="section-number-3">4.1</span> try / catch / finally</h3>
<div class="outline-text-3" id="text-4-1">
<p>
On doit commencer par déclarer le début d'un bloc <code class="src src-java"><span style="color: #0000FF;">try</span></code> avant de faire l'opération qui peut lancer une exception
contrôlée. Le bloc <code class="src src-java"><span style="color: #0000FF;">try</span></code> doit non seulement
contenir cette opération, mais toutes celles-ci en dépendent, par
exemple tout le code qui utilise un objet dont la construction aurait
pu déclencher une exception.
</p>

<p>
À la suite de ce bloc, on indique quelle exception on veut intercepter
avec un bloc <code class="src src-java"><span style="color: #0000FF;">catch</span></code>. bloc <code class="src src-java"><span style="color: #0000FF;">catch</span></code> prend un argument dont le type est celui de l'exception à
intercepter, ce qui permet d'utiliser cet argument ensuite dans le
bloc.
</p>

<p>
On doit utiliser un bloc <code class="src src-java"><span style="color: #0000FF;">finally</span></code> lorsqu'il y a du code qui doit être exécuté dans tous les cas :
</p>
<ul class="org-ul">
<li>pas d'exception ou exception interceptée</li>
<li>exception propagée</li>

<li id="Exercice"> 

<dl class="org-dl">
<dt>Modification de code</dt><dd>Modifier les programmes précédents pour
que <code class="src src-java">main</code> ne laisse plus échapper
d'exception mais affiche un message d'erreur. N'oubliez pas que
l'appel à <code class="src src-java">.close()</code> doit être effectué
<b>dans tous les cas</b>.</dd>

<dt>Ajout de fonctionalité</dt><dd>Modifier les programmes précédents pour
qu'en cas d'erreur, ils proposent de recommencer :
<ul class="org-ul">
<li>en effectuant une autre saisie pour la lecture d'un nombre</li>

<li>en saisissant un nom de fichier pour la lecture à partir d'un
fichier (dans le cas d'une <code class="src src-java">FileNotFoundException</code>).</li>
</ul></dd>
</dl></li>
</ul>

<p>
Pour aller plus loin, <a href="https://www.jmdoudoux.fr/java/dej/chap-exceptions.htm">une ressource indiquant notamment comment créer
ses propres types d'exceptions</a>.
</p>
</div>
</div>
