session1/cours/java_io.md


<a id="org882c51a"></a>

## Lecture depuis un fichier

Il y a plusieurs façons de lire le contenu d'un petit fichier de texte, mais on peut notamment utiliser une instance de la classe [java.io.File](https://docs.oracle.com/javase/8/docs/api/java/io/File.html) à la place de [System.in](https://docs.oracle.com/javase/8/docs/api/java/lang/System.html#in) :

```java
import java.io.FileNotFoundException;
import java.io.File;
import java.util.Scanner;

public class ScannerFromFileDemo {
    public static void main(String[] args) throws FileNotFoundException {
	Scanner sc = new Scanner(new File("inputFile.txt"));
	for(int i=0; sc.hasNextLine(); ++i){
	    System.out.println("["+i+"]:"+ sc.nextLine());
	}
	sc.close();
    }
}

```

De même que pour l'instance de l'instance de [java.io.PrintStream](https://docs.oracle.com/javase/8/docs/api/java/io/PrintStream.html), il faut désormais s'assurer que la méthode [close()](https://docs.oracle.com/javase/10/docs/api/java/util/Scanner.html#close()) est appelée.

-   **Exercice:** Modifier le programme ci-dessus pour qu'il lise les mêmes informations que le programme `ScannerDemo` et mettre le code de lecture dans une autre fonction appelée par java\_src[:exports code]{main}.


<a id="org7c16ce1"></a>

# <a id="orge248a59"></a>Gestion des Exceptions

En pratique, on ne peut évidemment pas se contenter de laisser les exceptions se propager. On va donc les [gérer localement](https://docs.oracle.com/javase/tutorial/essential/exceptions/handling.html) en utilisant des blocs `try` / `catch` et éventuellement `finally`.


<a id="org11adba5"></a>

## try / catch / finally

On doit commencer par déclarer le début d'un bloc `try` avant de faire l'opération qui peut lancer une exception contrôlée. Le bloc `try` doit non seulement contenir cette opération, mais toutes celles-ci en dépendent, par exemple tout le code qui utilise un objet dont la construction aurait pu déclencher une exception.

À la suite de ce bloc, on indique quelle exception on veut intercepter avec un bloc `catch`. bloc `catch` prend un argument dont le type est celui de l'exception à intercepter, ce qui permet d'utiliser cet argument ensuite dans le bloc.

On doit utiliser un bloc `finally` lorsqu'il y a du code qui doit être exécuté dans tous les cas :

-   pas d'exception ou exception interceptée
-   exception propagée

-   **Exercice:**  
    -   **Modification de code:** Modifier les programmes précédents pour que `main` ne laisse plus échapper d'exception mais affiche un message d'erreur. N'oubliez pas que l'appel à `.close()` doit être effectué **dans tous les cas**.
    
    -   **Ajout de fonctionalité:** Modifier les programmes précédents pour qu'en cas d'erreur, ils proposent de recommencer :
        -   en effectuant une autre saisie pour la lecture d'un nombre
        
        -   en saisissant un nom de fichier pour la lecture à partir d'un fichier (dans le cas d'une `FileNotFoundException`).

Pour aller plus loin, [une ressource indiquant notamment comment créer ses propres types d'exceptions](https://www.jmdoudoux.fr/java/dej/chap-exceptions.htm).
